[
    {
        "name":"Vakratunda Mahakaya",
        "shloka":"Vakratunda Mahakaya, Surya Koti Samaprabha Nirvighnam Kurume Deva Sarva Karyeshu Sarvadah",
        "range":"short",
        "godName":"Lord Ganesha",
        "purpose":"This shloka is often chanted at the beginning of important ceremonies or rituals as Lord Ganesha is believed to be the remover of obstacles and the lord of auspicious beginnings."
    },
    {
        "name":"Tryambakam Yajamahe",
        "shloka":"Om Tryambakam Yajamahe Sugandhim Pushtivardhanam Urvarukamieva Bandhanan Mrityormukshiya Mamrita",
        "range":"short",
        "godName":"Shri Mahadeva",
        "purpose":"This mantra is often chanted or recited in Hinduism for protection, health, and spiritual enlightenment. It is believed that the mantra has the power to conquer death and bring about a long and healthy life. The reference to the cucumber in the mantra is symbolic of the soul's release from the cycle of birth and death, similar to how a cucumber is severed from its vine."
    },
    {
        "name":"Mangalam Vishnu",
        "shloka":"Mangalam Vishnu Mangalam Garudadhvaja Mangalam Pundarikaksha Mangalay Tano Harih",
        "range":"short",
        "godName":"Sri Hari Vishnu",
        "purpose":"The shloka invokes the blessings of Lord Vishnu and is chanted to seek his protection, grace, and blessings for a happy and peaceful life."
    },
    {
        "name":"Shri Suktam",
        "shloka":"Om Hiranya Varnaam Harineem Suvarna Rajata Srajaam । Chandraam Hiranmayeem Lakshmeem Jaatavedo Ma Aa Vaha ॥1॥ Taam Ma Aa Vaha Jaatavedo Lakshmee Manapa Gaamineem । Yasyaam Hiranyam Vindeyam Gaamashvam Purushaa Naham ॥2॥ Ashva Purvaam Ratha Madhyaam Hastinaada Pramodineem । Shriyam Deveemupa Hvaye Shreermaa Devee Jushataam ॥3॥ Kaam Sosmitaam Hiranya Praakaaraa Maardraam Jvalanteem Triptaam Tarpayanteem । Padme Sthitaam Padma Varnaam Taamihopa Hvaye Shriyam ॥4॥ Chandraam Prabhaasaam Yashasaa Jvalanteem Shriyam Loke Deva Jushtaa Mudaaraam । Taam Padmineemeem Sharanam Prapadye Alakshmeerme Nashyataam Tvaam Vrine ॥5॥ Aaditya Varne Tapasoadhi Jaato Vanaspati Stava Vrikshoatha Bilvah । Tasya Phalaani Tapasaa Nudantu Yaa Antaraa Yaashcha Baahyaa Alakshmeeh ॥6॥ Upaitu Maam Devasakhah Keertishcha Maninaa Saha । Praadurbhutoasmi Raashtreasmin Keerti Mriddhim Dadaatu Me ॥7॥ Kshutpipaasaa Malaam Jyeshthaama Lakshmeem Naashayaa Myaham । Abhutima Samriddhim Cha Sarvaam Nirnuda Me Grihaat ॥8॥ Gandha Dvaaraam Duraadharshaam Nitya Pushtaam Kareeshineem । Ishvareem Sarva Bhutaanaam Taamihopa Hvaye Shriyam ॥9॥ Manasah Kaamamaa Kutim Vaachah Satya Masheemahi । Pashunaam Rupa Mannasya Mayi Shreeh Shrayataam Yashah ॥10॥ Kardamena Prajaa Bhutaa Mayi Sambhava Kardama । Shriyam Vaasaya Me Kule Maataram Padma Maalineem ॥11॥ Aapah Srijantu Snigdhaani Chikleeta Vasa Me Grihe । Ni Cha Deveem Maataram Shriyam Vaasaya Me Kule ॥12॥ Aardraam Pushkarineem Pushtim Pingalaam Padma Maalineem ।Chandraam Hiranmayeem Lakshmeem Jaatavedo Ma Aa Vaha ॥13॥ Aardraam Yah Karineem Yashtim Suvarnaam Hema Maalineem । Suryaam Hiranmayeem Lakshmeem Jaatavedo Ma Aa Vaha ॥14॥ Taam Ma Aa Vaha Jaatavedo Lakshmee Manapa Gaamineem ।Yasyaam Hiranyam Prabhutam Gaavo Daasyo Ashvaan Vindeyam Purushaa Naham ॥15॥ Yah Shuchih Prayato Bhutvaa Juhuyaadaajya Manvaham । Suktam Pancha Dasharcham Cha Shree Kaamah Satatam Japet ॥16॥ Padmaanane Padma Vipadma Patre Padmapriye Padma Dalaayataakshi । Vishvapriye Vishnu Manoanukule Tvatpaada Padmam Mayi San Ni Dhatsva ॥17॥ Padmaanane Padmauru Padmaakshi Padma Sambhave । Tanme Bhajasi Padmaakshi Yena Saukhyam Labhaamyaham ॥18॥ Ashvadaayi Godaayi Dhanadaayi Mahaadhane । Dhanam Me Jushataam Devi Sarva Kaamaanshcha Dehi Me ॥19॥ Putra Pautra Dhanam Dhaanyam Hastya Shvaashvataree Ratham । Prajaanaam Bhavasi Maataa Aayushmantam Karotu Me ॥20॥ Dhanamagnir Dhanam Vaayur Dhanam Suryo Dhanam Vasuh । Dhanamindro Brihaspatir Varuno Dhana Mashvinaa ॥21॥ Vainateya Somam Piba Somam Pibatu Vritrahaa । Somam Dhanasya Somino Mahyam Dadaatu Sominah ॥22॥ Na Krodho Na Cha Maatsaryam Na Lobho Naashubhaa Matih । Bhavanti Krita Punyaanaam Bhaktyaa Shree Sukta Jaapinaam ॥23॥ Sarasija Nilaye Saroja Haste Dhavala Taraanshuka Gandha Maalya Shobhe । Bhagavati Hari Vallabhe Manogye Tribhuvana Bhutikari Praseeda Mahyam ॥24॥ Vishnu Patneem Kshamaam Deveem Maadhaveem Maadhava Priyaam । Lakshmeem Priya Sakheem Bhumim Namaamya Chyuta Vallabhaam ॥25॥ Mahaa Lakshmyai Cha Vidmahe Vishnu Patnyai Cha Dheemahi । Tanno Lakshmeeh Prachodayaat ॥26॥ Aanandah Kardamah Shree Dashchikleeta Iti Vishrutaah । Rishayah Shriyah Putraashcha Shreer Deveer Devataa Mataah ॥27॥ Rinarogaadi Daaridrya Paapa Kshudapa Mrityavah । Bhaya Shoka Manastaapaa Nashyantu Mama Sarvadaa ॥28॥ Shreer Varchasva Maayushya Maarogya Maavidhaachchhobha Maanam Maheeyate । Dhanam Dhaanyam Pashum Bahuputra Laabham Shata Samvatsaram Deergha Maayuh ॥29॥",
        "range":"long",
        "godName":"Lakshmi",
        "purpose":"It is dedicated to the goddess Lakshmi, who is considered the goddess of wealth, prosperity, and fortune. The hymn consists of sixteen verses, and it is believed to bring blessings of abundance and prosperity to those who recite it with devotion."
    },
    {
        "name":"Durga Suktam",
        "shloka":"Om Jatavedase sunavama soma marateeyatho nidahathi vedahaSa nah parshadati Durgani viswa naveva sindhum duritaatyagnihi (1) Tamagni varnaam tapasa jwalanteem vairochaneem karma phaleshu justhamm Durgam devigum sharanamaham prapadye sutarasi tarase namaha (2) Agne twam paraya navyo asmaam swasthibhirathi Durgani viswa Puuscha prudhivi bahulaa na urvi bhavaa thokaya tanayaya shamyoh (3) Viswani noo Durgaha jatavedah sindhum na navaa durithatiparshi Agne atrivanmanasa grunanoosmakam bhodyavitha tanunaam (4) Prutana jithagum sahamanamugra-magnigum huvema paramadsadasdath Sa nah parshadati Durgani viswa kshaamaddevo ati duritaat-yagnihi (5) Pratnoshi kameedyo adhvareshu sanaccha hota navyascha satsi Swamchagne tanuvam pipraya-swasmabhyam cha saubhagamayajaswa (6) Gobhirjustha-mayujo nishiktham tavendra vishnoranu-sancharema Nakasya prusthamabhi samvasano vaishnavim loka iha madayantham (7) Om katyayanaya vidmahe Kanyakumari dhemahi tanno durgi prachodayath Om shanthi shanthi santhihi",
        "range":"long",
        "godName":"Durga",
        "purpose":" The purpose of the hymn is to invoke the blessings and protection of Goddess Durga, who is regarded as the ultimate embodiment of feminine power and strength."
    }

]